app/Controllers/Main.php

SELECT COUNT(*) AS `numrows` FROM `departments`
SELECT COUNT(*) AS `numrows` FROM `designations`
SELECT COUNT(*) AS `numrows` FROM `employees`
SELECT COUNT(*) AS `numrows` FROM `payrolls`
---
    public function index()
    {
        $this->data['page_title']="Home";
        $this->data['departments']=$this->dept_model->countAll();
        $this->data['designations']=$this->desg_model->countAll();
        $this->data['employees']=$this->emp_model->countAll();
        $this->data['payrolls']=$this->payroll_model->countAll();

SELECT *
FROM `users`
WHERE `id` != '1'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `id` != '1'
---
    public function users(){
        $this->data['page_title']="Users";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        $this->data['total'] =  $this->auth_model->where("id != '{$this->session->login_id}'")->countAllResults();
        $this->data['users'] = $this->auth_model->where("id != '{$this->session->login_id}'")->paginate($this->data['perPage']);

SELECT *
FROM `departments`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `departments`
---
    public function departments(){
        $this->data['page_title']="Departments";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        $this->data['total'] =  $this->dept_model->countAllResults();
        $this->data['departments'] = $this->dept_model->paginate($this->data['perPage']);

SELECT *
FROM `designations`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `designations`
---
    public function designations(){
        $this->data['page_title']="Designations";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        $this->data['total'] =  $this->desg_model->countAllResults();
        $this->data['designations'] = $this->desg_model->paginate($this->data['perPage']);

SELECT COUNT(*) AS `numrows`
FROM `payrolls`
SELECT *
FROM `payrolls`
 LIMIT 10
---
    public function payrolls(){
        $this->data['page_title']="Payrolls";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        $this->data['total'] =  $this->payroll_model->countAllResults();
        $this->data['payrolls'] = $this->payroll_model->paginate($this->data['perPage']);

SELECT *, CONCAT(employees.last_name, ', ', `employees`.`first_name`, COALESCE(CONCAT(' ', employees.middle_name), '')) as `name`
FROM `employees`
SELECT *
FROM `payrolls`
---
                }
            }
        }
        $this->data['employees'] = $this->emp_model->select("*, CONCAT(employees.last_name, ',', employees.first_name, COALESCE(CONCAT(' ', employees.middle_name), '')) as `name`")->findAll();
        $this->data['payrolls'] = $this->payroll_model->findAll();